In [44]:
import pandas as pd
import numpy as np

In [45]:
columns_to_drop = ['PassengerId', 'Name']

In [46]:
train_df = pd.read_csv('../datasets/titanic/train.csv')
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [47]:
#Data description:

#Survival - Survival (0 = No; 1 = Yes). Not included in test.csv file.
#Pclass - Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
#Name - Name
#Sex - Sex
#Age - Age
#Sibsp - Number of Siblings/Spouses Aboard
#Parch - Number of Parents/Children Aboard
#Ticket - Ticket Number
#Fare - Passenger Fare
#Cabin - Cabin
#Embarked - Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)

In [48]:
train_df.drop(columns=columns_to_drop, inplace=True)
train_df.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,0,3,male,35.0,0,0,373450,8.0500,NaN,S